---
title: FormFailures
classe: Autodesk.Revit.DB.BuiltInFailures+FormFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 11
---

# FormFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId AddProfileFailure { get; }` | `FormFailures.AddProfileFailure` | FailureDefinitionId |
| `FailureDefinitionId DissolveNoValidInputs { get; }` | `FormFailures.DissolveNoValidInputs` | FailureDefinitionId |
| `FailureDefinitionId DissolveUnableToDissolveForm { get; }` | `FormFailures.DissolveUnableToDissolveForm` | FailureDefinitionId |
| `FailureDefinitionId FormCreationInvalidGeomCombination { get; }` | `FormFailures.FormCreationInvalidGeomCombination` | FailureDefinitionId |
| `FailureDefinitionId FormElemRegenFailure { get; }` | `FormFailures.FormElemRegenFailure` | FailureDefinitionId |
| `FailureDefinitionId FormElemRegenFailureError { get; }` | `FormFailures.FormElemRegenFailureError` | FailureDefinitionId |
| `FailureDefinitionId FormElemRegenSelfIntersection { get; }` | `FormFailures.FormElemRegenSelfIntersection` | FailureDefinitionId |
| `FailureDefinitionId FormElemRegenSelfIntersectionReorderProfiles { get; }` | `FormFailures.FormElemRegenSelfIntersectionReorderProfiles` | FailureDefinitionId |
| `FailureDefinitionId FormElemRegenSelfIntersectionResetConnections { get; }` | `FormFailures.FormElemRegenSelfIntersectionResetConnections` | FailureDefinitionId |
| `FailureDefinitionId OpenProfileMultiSegmentSweepsNotSupported { get; }` | `FormFailures.OpenProfileMultiSegmentSweepsNotSupported` | FailureDefinitionId |
| `FailureDefinitionId VoidFormsNotUsed { get; }` | `FormFailures.VoidFormsNotUsed` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```